run/T_channel/carreau/ohmic/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inletNorth
    {
	type            zeroGradient;
    }
    
    inletSouth
    {
	type            zeroGradient;
    }
    
    
      
    topwalls 
    {
	
	type            slipSigmaDependent;
	elecMobility0   1.34e-08;
	sigma0          0.0038;
	m               -0.3;
	value           uniform (0 0 0);        
    }
    
    botwalls 
    {
	type            slipSigmaDependent;
	elecMobility0   1.34e-08;
	sigma0          0.0038;
	m               -0.3;
	value           uniform (0 0 0);        
    }
    frontAndBack
    {
	type            empty;        
    }

    outlet
    {
	type            zeroGradient;     
    }
}
  

// ************************************************************************* //
