run/T_channel/carreau/ohmic/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 2.5e-05;

vertices
(

//  (-8 -1 0)
  (-2 -4 0)         //1
  (-2 4 0)         //2
//  (-8 1 0)        //3
  (-2 -14 0)          //4
  (2 -14 0)             //5
  (2 -4 0)         //6
  (82 -4 0)           //7
  (82 4 0)  //7         //8
  (2 4 0)       //9
  (2 14 0)  //9       //10
  (-2 14 0)   //11
//  (-8 -1 2.68)  //12
  (-2 -4 2.68)     //13
  (-2 4 2.68)  //12      //14
//  (-8 1 2.68) //15
  (-2 -14 2.68) //16
  (2 -14 2.68)  //17
  (2 -4 2.68) //18
  (82 -4 2.68)  //19
  (82 4 2.68) //17//20
  (2 4 2.68)  //21
  (2 14 2.68) //19 //22
  (-2 14 2.68)   //23
  // (-8 0 0)//24 
  (-2 0 0) //21  //25
  (0 4 0) //22  //26
  (0 14 0)   //27
  (2 0 0) //24 //28
  (82 0 0)   //29
  (0 -4 0) //26 //30
  (0 -14 0) //31
//  (-8 0 2.68)//32  
  (-2 0 2.68) //28//33
  (0 4 2.68) //34
  (0 14 2.68) //35
  (2 0 2.68)  //31//36
  (82 0 2.68)  //37
  (0 -4 2.68) //33 //38
  (0 -14  2.68)  //39
  (0 0 0) //35  40
  (0 0 2.68) //36 41
  
 

);

blocks
(

/*    hex (0 1 25 24 12 13 33 32) (50 10 11) simpleGrading (.7 1 1) //0    
    hex (24 25 2 3 32 33 14 15) (50 10 11) simpleGrading (.7 1 1) //1 */

    hex (1 21 22 9 11 28 29 19) B0 (10 50 1) simpleGrading (1 1.4285714286 1) //2
    hex (21 7 8 22 28 17 18 29) B1 (10 50 1) simpleGrading (1 1.4285714286 1) //3

    hex (23 24 6 7 30 31 16 17) B2 (450 75 1) simpleGrading (1 0.1 1) //4
    hex (4 5 24 23 14 15 31 30) B3 (450 75 1) simpleGrading (1 10 1) //5
    
    hex (26 3 4 25 33 13 14 32) B4 (10 50 1) simpleGrading (1 .7 1) //6
    hex (2 26 25 0 12 33 32 10) B5 (10 50 1) simpleGrading (1 .7 1) //7
    
    hex (20 34 21 1 27 35 28 11) B6 (10 75 1) simpleGrading (1 0.1 1) //8
    hex (0 25 34 20 10 32 35 27) B7 (10 75 1) simpleGrading (1 10 1) //9
    hex (25 4 23 34 32 14 30 35) B8 (10 75 1) simpleGrading (1 10 1) //10
    hex (34 23 7 21 35 30 17 28) B9 (10 75 1) simpleGrading (1 .1 1) //11

 
    
);

edges
(

 
);

boundary
(
    
     inletNorth
     {
      type patch;
      faces
      (
            (9 22 29 19)
            (22 8 18 29)
            
        );
    }
    
    inletSouth
    {
        type patch;
        faces
        (
            (2 26 33 12)
            (26 3 13 33)
            
        );
    }
    
    outlet
    {
        type patch;
        faces
        (
            (5 24 31 15)
            (24 6 16 31)
            
        );
    }     
    
  /*  inletWest
    {
        type patch;
        faces
        (
            (0 20 27 10)
            (20 1 11 27)
            
        );
    }*/
    
    frontAndBack
    {
        type empty;
        faces
        (
            
            
            (2 26 25 0)
            (0 25 34 20)
            (20 34 21 1)
            (1 21 22 9)
            (26 3 4 25)
            (25 4 23 34)
            (34 23 7 21)
            (21 7 8 22)
            (4 5 24 23)
            (23 24 6 7)
            (12 33 32 10)
            (10 32 35 27)
            (27 35 28 11)
            (11 28 29 19)
            (33 13 14 32)
            (32 14 30 35)
            (35 30 17 28)
            (28 17 18 29)
            (14 15 31 30)
            (30 31 16 17)
            
        );
    }
    
    topwalls
    {
        type wall;
        faces
        (
            
            (1 9 19 11)
            (8 7 17 18)
            (7 6 16 17)
            (20 1 11 27)
            
            
            
                     
        );
    }
    botwalls
    {
        type wall;
        faces
        (
         
            (5 4 14 15)
            (4 3 13 14)
            (0 2 12 10)
            (0 20 27 10)
            
                     
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
